### Topics

csv - comma separated values  
json - javascript object notation

In [1]:
data = {"students":[{"name":"siraj","major":"physics"},{"name":"hari","major":"maths"}]}

In [2]:
data['students'][0]['major']

'physics'

## workout some examples to understand the two function in  json module<br>
- import json
- json.loads
- json dumps
### Files
 - open
 - f.readlines
 - f.write
 - f.read

In [5]:
import pandas as ps
ps.__version__

'0.25.1'

### Creating series from 
- a list 
- a tuple
- a dict
- an ndarray

In [8]:
s1 = ps.Series([1,2,3,4])
print(s1[0])
print(s1)

1
0    1
1    2
2    3
3    4
dtype: int64

### Indexing
 - label based indexing
 - Position based indexing(0 to n-1)

In [9]:
s2 = ps.Series([1,2,3,4],['one','two','three','four'])
print(s2)
print(s2['one']) # label based Indexing
print(s2[0]) # label based Indexing

one      1
two      2
three    3
four     4
dtype: int64
1
1

In [11]:
s3 = ps.Series((1,2,3,4),('one','two','three','four'))
print(s3)
print(s3['one']) # label based Indexing
print(s3[0]) # label based Indexing

one      1
two      2
three    3
four     4
dtype: int64
1
1

In [12]:
d = {"std1":87,"std2":78,"std3":94}
ps.Series(d)

std1    87
std2    78
std3    94
dtype: int64

In [14]:
# to get the labels of a series
print(s3.index)
print(s1.index)

Index(['one', 'two', 'three', 'four'], dtype='object')
RangeIndex(start=0, stop=4, step=1)

In [17]:
import numpy as np
a1 = [1,2,3,4]
a1

[1, 2, 3, 4]

In [18]:
a1

[1, 2, 3, 4]

In [19]:
# to convert a numpy array into pandas Series
as1 = ps.Series(a1)
as1

0    1
1    2
2    3
3    4
dtype: int64

In [20]:
print(type(s1))
print(type(a1))

<class 'pandas.core.series.Series'>
<class 'list'>

### Create a Dataframe from a dictionary

In [21]:
data = {"name":['hari','raj','roja','gita'],'major':['go','python','r','scala']}
data

{'name': ['hari', 'raj', 'roja', 'gita'],
 'major': ['go', 'python', 'r', 'scala']}

In [23]:
df = ps.DataFrame(data)
df

   name   major
0  hari      go
1   raj  python
2  roja       r
3  gita   scala

In [24]:
print(df)

   name   major
0  hari      go
1   raj  python
2  roja       r
3  gita   scala

In [25]:
df['name']

0    hari
1     raj
2    roja
3    gita
Name: name, dtype: object

In [26]:
print(type(df))
print(type(df['name']))

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>

In [29]:
print(df.shape)
print(s3.shape)

(4, 2)
(4,)

In [31]:
df1 = ps.read_csv('data.csv')
df1

         name  laptop  ram
0      deepak      hp    4
1  parameswar  lenovo    8
2         ali  lenovo   20
3     vineeth    dell    8
4    Srikanth      hp   16
5   chaitanya  lenovo    8
6     bhargav  lenovo    4
7       jagan  lenovo    8
8        ravi  lenovo    8
9      sankar    dell   32

In [32]:
df1.head()

         name  laptop  ram
0      deepak      hp    4
1  parameswar  lenovo    8
2         ali  lenovo   20
3     vineeth    dell    8
4    Srikanth      hp   16

In [38]:
df1.sample()

         name  laptop  ram
1  parameswar  lenovo    8

In [39]:
df1.shape

(10, 3)

In [41]:
# how many rows are there in the data
df1.shape[0]

10

In [42]:
df1.columns

Index(['name', 'laptop', 'ram'], dtype='object')

In [43]:
df1.index = [19,11,13,16,2,15,26,15,17,18]
df1

          name  laptop  ram
19      deepak      hp    4
11  parameswar  lenovo    8
13         ali  lenovo   20
16     vineeth    dell    8
2     Srikanth      hp   16
15   chaitanya  lenovo    8
26     bhargav  lenovo    4
15       jagan  lenovo    8
17        ravi  lenovo    8
18      sankar    dell   32

In [49]:
ps.read_csv('data.csv',header='infer')

         name  laptop  ram
0      deepak      hp    4
1  parameswar  lenovo    8
2         ali  lenovo   20
3     vineeth    dell    8
4    Srikanth      hp   16
5   chaitanya  lenovo    8
6     bhargav  lenovo    4
7       jagan  lenovo    8
8        ravi  lenovo    8
9      sankar    dell   32

In [50]:
ps.read_csv('data.csv',header=None,names=['col1','col2','col3'])

          col1    col2 col3
0         name  laptop  ram
1       deepak      hp    4
2   parameswar  lenovo    8
3          ali  lenovo   20
4      vineeth    dell    8
5     Srikanth      hp   16
6    chaitanya  lenovo    8
7      bhargav  lenovo    4
8        jagan  lenovo    8
9         ravi  lenovo    8
10      sankar    dell   32

In [51]:
ps.read_csv('data.csv',usecols=['ram'])

   ram
0    4
1    8
2   20
3    8
4   16
5    8
6    4
7    8
8    8
9   32

In [52]:
ps.read_csv('data.csv',usecols=['ram','name'])

         name  ram
0      deepak    4
1  parameswar    8
2         ali   20
3     vineeth    8
4    Srikanth   16
5   chaitanya    8
6     bhargav    4
7       jagan    8
8        ravi    8
9      sankar   32

### Slicing

In [53]:
df1[['name','ram']]

          name  ram
19      deepak    4
11  parameswar    8
13         ali   20
16     vineeth    8
2     Srikanth   16
15   chaitanya    8
26     bhargav    4
15       jagan    8
17        ravi    8
18      sankar   32

In [54]:
# check the difference
df1['name'] # return value is series
df1[['name']] # dataframe with one column

          name
19      deepak
11  parameswar
13         ali
16     vineeth
2     Srikanth
15   chaitanya
26     bhargav
15       jagan
17        ravi
18      sankar

In [55]:
print(type(df1['name'] ))
print(type(df1[['name']]))

<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>

In [57]:
# To check the data type of each column
print(type(df1.dtypes))
print(df1['name'].dtype)
df1.dtypes

<class 'pandas.core.series.Series'>
object

name      object
laptop    object
ram        int64
dtype: object

In [58]:
print(type(df1.columns))

<class 'pandas.core.indexes.base.Index'>

In [59]:
print(df1.columns[0])
print(df1.columns[1])

name
laptop